Descriptor:
  Name: Microsoft Exposure Management
  DisplayName: Microsoft Exposure Management
  Description: This combined KQL plugin integrates capabilities of Microsoft Exposure Management with Security Copilot.

#  Settings:
#    - Name: TenantId
#      Description: Your Azure Tenant ID where the Sentinel workspace is in.
#      HintText: Enter your Azure Tenant ID
#      SettingType: string
#      value: 
#      Required: true
#      
#    - Name: SubscriptionId
#      Description: Your Azure Subscription ID where the Sentinel workspace is provisioned.
#      SettingType: string
#      Required: true
#      HintText: Enter your Azure Subscription ID.
#
#    - Name: WorkspaceName
#      Description: The name Sentinel workspace that you'd like to reference.
#      SettingType: string
#      Required: true
#      HintText: Enter the Sentinel workspace that you'd like to reference.     
#
#    - Name: ResourceGroupName
#      Description: The Resource Group where the Sentinel workspace is provisioned..
#      SettingType: string
#      HintText: Enter your Resource Group where the Sentinel workspace is provisioned.
#      Required: true

  SupportedAuthTypes:
    - None

#####################################################################################
# SkillGroups can be a single type (KQL, GPT, API) or contain a mix
#####################################################################################
    
SkillGroups:
  - Format: KQL
    

    Skills:
      - Name: GetExposedDevicesByCloudPlatform
        DisplayName: Get exposed Devices by Cloud Platform and exposure level. 
        Description: For a specific cloud platform (aka "Azure" or "GCP" or "AWS") or a list of cloud platform of the device separated by commas, semi-colons, or using the word 'or', get a list of devices 
          based on the exposure level specified by the user (aka "Low" or "Medium" or "High") or a list of exposures separated by commas.
        DescriptionForModel: For a specific cloud platform of the device (aka "Azure" or "GCP" or "AWS") or a list of cloud platform of the device separated by commas, get a list of devices based on the exposure level specified by the user (aka "Low" or "Medium" or "High") or a list of exposures separated by commas.          The results will be returned as a response to the query containing multiple entries, the user needs to be shown the below details from the response about each device DeviceName, DeviceId, ExposureLevel, CloudPlatforms, OSPlatform, OSArchitecture.
          VERY IMPORTANT - Never truncate the list of devices retrieved by launching the KQL query related to this skill. Also if the user wants to search on premises then the value for CloudPlatforms should be blank in the query
        Inputs:
            - Name: inputExposureLevel
              Description: provide the exposure level you want to consider - e.g. High, Medium, Low (only one level)
              Required: true
            - Name: inputCloudPlatforms
              Description: provide the cloud platform of the device you want to consider - e.g. Azure or GCP or AWS
              Required: false
          
        Settings:
          Target: Defender
          Template: |-
            let userExposureLevel='{{inputExposureLevel}}';
            let userCloudPlatform='{{inputCloudPlatforms}}';
            DeviceInfo
            | where ExposureLevel in (userExposureLevel)
            | where
              (CloudPlatforms == '' and isempty(userCloudPlatform)) or
              (CloudPlatforms != '' and CloudPlatforms contains userCloudPlatform)
            | project DeviceName, DeviceId, ExposureLevel, CloudPlatforms, OSPlatform, OSArchitecture, TimeGenerated    
      
      - Name: GetExposedDevicesByUser
        DisplayName: Get exposed devices by UPN and optinally exposure level
        Description: For a specific user UPN (aka "user" or "UPN") or a list of users separated by commas, get a list of devices 
          based on the exposure level specified by the user (aka "Low" or "Medium" or "High") or a list of exposures separated by commas.
        DescriptionForModel: For a specific user UPN (aka "user" or "UPN") or a list of users separated by commas, get a list of devices
          based on the exposure level specified by the user (aka "Low" or "Medium" or "High") or a list of exposures separated by commas.
          The results will be returned as a response to the query containing multiple entries, the user needs to be shown the below details from the response about each device UPN, DeviceName, DeviceId, ExposureLevel, CloudPlatforms, OSPlatform, OSArchitecture.
          VERY IMPORTANT - Never truncate the list of devices retrieved by launching the KQL query related to this skill. Also if the user wants to search on premises then the value for CloudPlatforms should be blank in the query.
        Inputs:
            - Name: inputExposureLevel
              Description: provide the exposure level you want to consider - e.g. High, Medium, Low
              Required: false
            - Name: inputUPN
              Description: provide the user primary name (UPN)
              Required: true
        Settings:
          Target: Defender
          Template: |-
            let userExposureLevel='{{inputExposureLevel}}';
            let userUPN='{{inputUPN}}';
            IntuneDevices
            | where UPN contains userUPN
            | project DeviceName = tolower(DeviceName)
            | join kind=inner  (
                DeviceInfo
                | where ExposureLevel == "Medium"
                | project DeviceName = tolower(DeviceName), DeviceId,ExposureLevel, CloudPlatforms, OSPlatform, OSArchitecture, TimeGenerated
            ) on DeviceName

